code-review/NRB_3471_3546/База_Было/InformationRegisters/ПараметрыГлобальные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПараметрыГлобальные</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИмяПараметра</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/CommonModules/ВнешниеДанные/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Процедура выполняет подключение к базе SQL через ADO. Инициализируются переменные Соединение, Команда, RecordSet и ТипЗапросов.
// Если Соединение, Команда или RecordSet уже инициализирированы, то сначала происходит разрыв имеющегося соединения.
// Параметры:
//	Параметры	 - Структура - должна содержать следующие элементы: Сервер, База, Логин, Пароль
//	Соединение	 - COMОбъект - или Неопределено
//	Команда		 - COMОбъект - или Неопределено
//	RecordSet	 - COMОбъект - или Неопределено
//	ТипыЗапросов - Структура - или Неопределено
Процедура ПодключитьсяКБазеSQL(Параметры, Соединение, Команда, RecordSet, ТипыЗапросов) Экспорт
	
	Если Соединение <> Неопределено Или Команда <> Неопределено Или RecordSet <> Неопределено Тогда
		Попытка
			ADODisconnect(Соединение, Команда, RecordSet);
		Исключение
			ТекстОшибки = "Не удалось разорвать соединение с SQL сервером по причине: " + Символы.ПС + ОписаниеОшибки();
			ВызватьИсключение ТекстОшибки;
		КонецПопытки;
	КонецЕсли;
	
	Соединение	= Новый COMОбъект("ADODB.Connection");
	Команда		= Новый COMОбъект("ADODB.Command");
	RecordSet	= Новый COMОбъект("ADODB.RecordSet");
	
	ConnectionString = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		"Provider=SQLOLEDB.1; Server=%1; Database=%2; uid=%3; pwd=%4",
		Параметры.Сервер, Параметры.База, Параметры.Логин, Параметры.Пароль);
	
	ТаймаутСоединения	= 20;
	ТаймаутЗапроса		= 0;
	
	Соединение.ConnectionTimeOut	= ТаймаутСоединения;
	Соединение.CommandTimeOut		= ТаймаутЗапроса;
	Команда.CommandTimeOut			= ТаймаутЗапроса;
	Соединение.CursorLocation		= 3;
	
	Попытка
		Соединение.Open(ConnectionString);
		ТипыЗапросов = ИнициализацияТиповADO();
	Исключение
		ТекстОшибки = "Не удалось установить соединение с SQL сервером по причине: " + Символы.ПС + ОписаниеОшибки();
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;
	
	Команда.ActiveConnection = Соединение;
	
КонецПроцедуры

Функция ИнициализацияТиповADO() экспорт
	Возврат Новый Структура("ОператорSQL, ХранимаяПроцедура, ПоУмолчанию",1,4,8);
КонецФункции

Функция ИнициализацияТиповПараметровADO() Экспорт
	// см. https://docs.microsoft.com/en-us/sql/ado/reference/ado-api/datatypeenum
	// adInteger - 3,
	// adDecimal - 14,
	// adBoolean - 11,
	// adDouble - 5,
	// adVarChar - 200,
	// adVarWChar - 202,
	// adDBTimeStamp - 135
	ТипыПараметров = Новый Структура;
	ТипыПараметров.Вставить("ЦелоеЧисло", 14);
	ТипыПараметров.Вставить("ДробноеЧисло", 14);
	ТипыПараметров.Вставить("Строка200", 200);
	ТипыПараметров.Вставить("Строка", 202);
	ТипыПараметров.Вставить("ДатаВремя", 135);
	ТипыПараметров.Вставить("Булево", 11);
	ТипыПараметров.Вставить("ДвоичныеДанные", 205);
	Возврат ТипыПараметров;
КонецФункции

Функция ИнициализацияТиповНаправленияПараметровADO() Экспорт
	Возврат Новый Структура("НаправлениеНеизвестно, Входящий, Исходящий, ВходящийИсходящий, ВозвращаетЗначение", 0, 1, 2, 3, 4);
КонецФункции

Процедура СформироватьПараметрыADO(Команда, ТаблицаПараметров) Экспорт
	ТипыПараметровADO = ВнешниеДанные.ИнициализацияТиповПараметровADO();
	
	Пока Команда.Parameters.Count>0 Цикл
		Команда.Parameters.Delete(Команда.Parameters.Count - 1);
	КонецЦикла;
	
	Для Каждого Элемент Из ТаблицаПараметров Цикл
		НовыйПараметр = НовыйПараметрADO(Команда, Элемент, ТипыПараметровADO);
		ВременноеЗначениеПараметра = Элемент.ЗначениеПараметра;
		
		// Если число больше, чем 10^15, тогда при установке его в качестве значения параметра
		// происходит "округление" до десятков. Помогает избежать этого приведение значения к строке.
		ДесятьВПятнадцатойСтепени = 1000000000000000;
		Если ТипЗнч(Элемент.ЗначениеПараметра) = Тип("Число") И Элемент.ЗначениеПараметра > ДесятьВПятнадцатойСтепени Тогда
			ВременноеЗначениеПараметра = Формат(ВременноеЗначениеПараметра, "ЧГ=");
		КонецЕсли;
		
		Команда.Parameters.Append(НовыйПараметр);
		Команда.Parameters(Элемент.ИмяПараметра).Value = ВременноеЗначениеПараметра;
	КонецЦикла;
	
КонецПроцедуры

Процедура ADOConnect(Соединение, Команда, RS, Знач ВнешнийИсточник = Неопределено, ТаймаутСоединения = 600, ТаймаутЗапроса = 300,
					ИспользоватьOUT = Неопределено) Экспорт
	Если ВнешнийИсточник = Неопределено Тогда
		ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.ExternalTables;
	КонецЕсли;
	
	Параметры = ПолучитьПараметрыВнешнегоИсточника(ВнешнийИсточник);
	
	Соединение 	= Новый COMОбъект("ADODB.Connection"); 
	Команда 	= Новый COMОбъект("ADODB.Command"); 
	RS 			= Новый COMОбъект("ADODB.RecordSet");
	ШаблонПодключенияКБДSQL = Параметры.ШаблонПодключенияКБДSQL;
	Если ПустаяСтрока(Параметры.ШаблонПодключенияКБДSQL) Тогда
		// Если есть логин и пароль, то делаем подключение с их учетом, иначе доверенное
		Если ЗначениеЗаполнено(Параметры.Логин) И ЗначениеЗаполнено(Параметры.Пароль) Тогда
			ШаблонПодключенияКБДSQL = "Provider=SQLOLEDB.1; Server=%SERVER%; Database=%DBNAME%; uid=%LOGIN%; pwd=%PASSWORD%";
		Иначе
			ШаблонПодключенияКБДSQL = "Provider=SQLOLEDB.1; Server=%SERVER%; Database=%DBNAME%;Trusted_Connection=yes;";
		КонецЕсли;
		//---	
	КонецЕсли;
	ConnectionString	= СтрокаПодключенияПоШаблонуИПараметрам(ШаблонПодключенияКБДSQL, Параметры);
	
	Соединение.ConnectionTimeOut	= ТаймаутСоединения; 
	Соединение.CommandTimeOut		= ТаймаутЗапроса;
	Команда.CommandTimeOut			= ТаймаутЗапроса;
	Соединение.CursorLocation		= 3; 
	
	Соединение.Open(ConnectionString);
	Команда.ActiveConnection = Соединение;
	
	ИспользоватьOUT = ИспользоватьДляПараметровХППризнакOUT(ConnectionString);
КонецПроцедуры

Процедура DBDisconnect(Соединение, Команда, RS) Экспорт
	Соединение = Неопределено; 
	Команда = Неопределено; 
	RS = Неопределено;
КонецПроцедуры

Функция SQLЗапрос(Команда, RS, ТекстЗапроса, Знач ТипКоманды = 8, ИспользоватьOUT = Истина) Экспорт
	Перем ВходящийЗапрос;
	Перем ТипыКомандADO, ТипыПараметровADO, ТипыНаправленийПараметраADO;
	
	ТипыКомандADO = ВнешниеДанные.ИнициализацияТиповADO();
	ТипыПараметровADO = ВнешниеДанные.ИнициализацияТиповПараметровADO();
	ТипыНаправленийПараметраADO = ВнешниеДанные.ИнициализацияТиповНаправленияПараметровADO();
	
	ВходящийЗапрос = ТекстЗапроса;
	КомментарийДляЛога = "";
	
	ЗапятаяЕслиНужно = "";
	Для Индекс = 0 По Команда.Parameters.Count - 1 Цикл
		ТекущийПараметр = Команда.Parameters(Индекс);
		Если ТипКоманды = ТипыКомандADO.ХранимаяПроцедура Тогда
			ТекстЗапроса = ТекстЗапроса + ЗапятаяЕслиНужно + " @" + ТекущийПараметр.Name + " = ?";
			ДобавитьПризнакПараметраOUT = ИспользоватьOUT
											И (ТекущийПараметр.Direction = ТипыНаправленийПараметраADO.Исходящий
												Или ТекущийПараметр.Direction = ТипыНаправленийПараметраADO.ВходящийИсходящий);
			Если ДобавитьПризнакПараметраOUT Тогда
				ТекстЗапроса = ТекстЗапроса + " OUT";
			КонецЕсли;
			ЗапятаяЕслиНужно = ",";
		КонецЕсли;
		КомментарийДляЛога = КомментарийДляЛога + ?(ЗначениеЗаполнено(КомментарийДляЛога), ", ", "Параметры: ")
			+ ТекущийПараметр.Name + "=" + ТекущийПараметр.Value;
	КонецЦикла;
		
	Команда.CommandText = ТекстЗапроса;
	
	ВидВызова = ВидВызоваДляЛогированияАДО(Команда.ActiveConnection);
	ВидДействия = ?(ТипКоманды = ТипыКомандADO.ХранимаяПроцедура, ВходящийЗапрос, "Запрос");
	ОписаниеВызова = РегистрыСведений.ЖурналРегистрацииВызовов.НовоеОписаниеВызова(ВидВызова, ВидДействия);
	КомментарийДляЛога = КомментарийДляЛога + ?(ЗначениеЗаполнено(КомментарийДляЛога), Символы.ПС, "") + СокрЛП(ТекстЗапроса);
	РегистрыСведений.ЖурналРегистрацииВызовов.ЗафиксироватьНачало(ОписаниеВызова, КомментарийДляЛога);
	
	Попытка
		RS = Команда.Execute();
		Рез = Истина;
		РегистрыСведений.ЖурналРегистрацииВызовов.ЗафиксироватьОкончание(ОписаниеВызова, КомментарийДляЛога);
	Исключение
		Рез = Ложь;
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ПодробноеПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		РегистрыСведений.ЖурналРегистрацииВызовов.ЗафиксироватьОшибку(ОписаниеВызова, ПодробноеПредставлениеОшибки, КомментарийДляЛога);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ПодробноеПредставлениеОшибки);
	КонецПопытки;
	
	Возврат Рез;
КонецФункции

Процедура ADODisconnect(Соединение, Команда, RS) Экспорт
	// Для старого кода, пока не заменим, на всякий пожарный
	DBDisconnect(Соединение, Команда, RS);
КонецПроцедуры

//Возвращает параметры внешнего источника для текущей базы из РС ВнешниеИсточники, в случае остутствия возвращает пустую структуру
//
// Параметры:
//  ВнешнийИсточник	 - Строка\ПланВидовХарактеристик.ВнешниеИсточники - Имя или ссылка на внешний источник
// 
// Возвращаемое значение:
//  Структура - Структура с параметрами внешнего источника
//
Функция ПолучитьПараметрыВнешнегоИсточника(ВнешнийИсточник) Экспорт
	
	Параметры = Новый Структура("Сервер,База,Логин,Пароль,Папка,Настройка,КлючПараметров,ШаблонПодключенияКБДSQL");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВнешниеИсточники.Сервер КАК Сервер,
	|	ВнешниеИсточники.БазаДанных КАК БазаДанных,
	|	ВнешниеИсточники.Логин КАК Логин,
	|	ВнешниеИсточники.Пароль КАК Пароль,
	|	ВнешниеИсточники.Настройка КАК Настройка,
	|	ВнешниеИсточники.ШаблонПодключенияКБДSQL КАК ШаблонПодключенияКБДSQL
	|ИЗ
	|	РегистрСведений.ВнешниеИсточники КАК ВнешниеИсточники
	|ГДЕ
	|	ВнешниеИсточники.КластерСерверов = &ИмяСервера
	|	И ВнешниеИсточники.ИнформационнаяБаза = &ИмяИБ
	|	И ВнешниеИсточники.ВнешнийИсточник = &ВнешнийИсточник";
	Запрос.УстановитьПараметр("ВнешнийИсточник", ВнешнийИсточник);
	Запрос.УстановитьПараметр("ИмяСервера", ПараметрыСеанса.ТекущийКластерСерверов);
	Запрос.УстановитьПараметр("ИмяИБ", ПараметрыСеанса.ТекущаяИнформационнаяБаза);
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		
		Параметры.Сервер					= СокрЛП(Выборка.Сервер);
		Параметры.Папка						= СокрЛП(Выборка.Сервер);
		Параметры.База						= СокрЛП(Выборка.БазаДанных);
		Параметры.Логин						= СокрЛП(Выборка.Логин);
		Параметры.Пароль					= СокрЛП(Выборка.Пароль);
		Параметры.Настройка					= Выборка.Настройка;
		Параметры.ШаблонПодключенияКБДSQL	= СокрЛП(Выборка.ШаблонПодключенияКБДSQL);
		
		КлючПараметров = Новый Структура();
		КлючПараметров.Вставить("ВнешнийИсточник", Запрос.Параметры.ВнешнийИсточник);
		КлючПараметров.Вставить("КластерСерверов", Запрос.Параметры.ИмяСервера);
		КлючПараметров.Вставить("ИнформационнаяБаза", Запрос.Параметры.ИмяИБ);
		Параметры.КлючПараметров = КлючПараметров;
		
	Иначе
		
		Комментарий = "Кластер серверов: " + ПараметрыСеанса.ТекущийКластерСерверов + Символы.ПС + "База данных: " + ПараметрыСеанса.ТекущаяИнформационнаяБаза;
		ЗаписьЖурналаРегистрации("Не удалось получить параметры внешнего источника", УровеньЖурналаРегистрации.Предупреждение,
			Метаданные.ОбщиеМодули.ВнешниеДанные, ВнешнийИсточник, Комментарий);
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось получить параметры внешнего источника '" + ВнешнийИсточник + "' для кластера серверов "
			+ ПараметрыСеанса.ТекущийКластерСерверов + " базы данных " + ПараметрыСеанса.ТекущаяИнформационнаяБаза + ".";
		Сообщение.Сообщить();
		
	КонецЕсли;
	
	Возврат Параметры;
	
КонецФункции // ПолучитьПараметрыВнешнегоИсточника()

// Открывает COM-соединение с внешней ИБ.
// 
Функция ОткрытьСоединениеСВнешнейБазой(ВнешнийИсточник) Экспорт
	Параметры = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ВнешнийИсточник);
	Если НЕ ЗначениеЗаполнено(Параметры.Сервер) ИЛИ НЕ ЗначениеЗаполнено(Параметры.База) Тогда
		ВызватьИсключение "Соединение с " + ВнешнийИсточник + " невозможно из-за незаполненных параметров соединения.";
	КонецЕсли;
	
	Попытка
		Коннектор = Новый ComОбъект("V83.COMConnector");
		Если ЗначениеЗаполнено(Параметры.Логин) Тогда
			СтрокаСоединения = "Srvr="""+Строка(Параметры.Сервер)+""";Ref="""+Строка(Параметры.База)+""";Usr="""+Строка(Параметры.Логин)+""";Pwd="""+Строка(Параметры.Пароль)+"""";
		Иначе
			СтрокаСоединения = "Srvr="""+Строка(Параметры.Сервер)+""";Ref="""+Строка(Параметры.База)+""";";
		КонецЕсли;
	
		База = Коннектор.Connect(СтрокаСоединения);
		СоединениеУстановлено = Истина;
		Возврат База;
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ТекстСообщения = "Ошибка соединения с базой данных " + Строка(Параметры.База) + ".";
		ЗаписьЖурналаРегистрации(ТекстСообщения, УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки);
		ВызватьИсключение ТекстСообщения;
	КонецПопытки;
	
КонецФункции

Функция СоздатьТаблицуПараметров() Экспорт
	
	ТаблицаПараметров = Новый ТаблицаЗначений();
	ТаблицаПараметров.Колонки.Добавить("ИмяПараметра");
	ТаблицаПараметров.Колонки.Добавить("ЗначениеПараметра");
	ТаблицаПараметров.Колонки.Добавить("НаправлениеПараметра");
	
	Возврат ТаблицаПараметров;
	
КонецФункции

Процедура ДобавитьПараметрВТаблицу(ТаблицаПараметров, ИмяПараметра, ЗначениеПараметра, Направление = Неопределено) Экспорт

	ТипыНаправленийПараметраADO = ВнешниеДанные.ИнициализацияТиповНаправленияПараметровADO();
	
	НовыйПараметр = ТаблицаПараметров.Добавить();
	НовыйПараметр.ИмяПараметра = ИмяПараметра;
	НовыйПараметр.ЗначениеПараметра = ЗначениеПараметра;
	НовыйПараметр.НаправлениеПараметра = ?(Направление = Неопределено, ТипыНаправленийПараметраADO.Входящий, Направление);

КонецПроцедуры

Процедура ИнициироватьСоединение(Обработчик, ИмяОбработки, Параметры = Неопределено) Экспорт
	Перем ПараметрыОбработки;
	Если Обработчик = Неопределено Тогда
		Если ТипЗнч(Параметры) = Тип("Структура") Тогда
			Если Параметры.Свойство("ИмяОбработки") Тогда
				ИмяОбработки = Параметры.ИмяОбработки;
			КонецЕсли;
			Параметры.Свойство("Параметры", ПараметрыОбработки);
		КонецЕсли;
		Обработчик = Обработки[ИмяОбработки].Создать();
		Обработчик.ИнициироватьСоединение(ПараметрыОбработки);
	КонецЕсли;
КонецПроцедуры

Процедура ДобавитьПараметрСоединения(Параметры, ИмяПараметра, Значение) Экспорт
	ПараметрыОбработки = Новый Структура(ИмяПараметра, Значение);
	Если ТипЗнч(Параметры) <> Тип("Структура") Тогда
		Параметры = Новый Структура("Параметры", ПараметрыОбработки);
	ИначеЕсли Не Параметры.Свойство("Параметры") Тогда
		Параметры.Вставить("Параметры", ПараметрыОбработки);
	КонецЕсли;
КонецПроцедуры

// Возвращает заполненную из параметров строку подключения по шаблону
//
// Параметры:
//  Шаблон		 - Строка - шаблон строки подключения
//  Параметры	 - Структура - Структура с ключами Сервер, БазаДанных, Логин, Пароль
// 
// Возвращаемое значение:
//  Строка - Строка подключения
//
Функция СтрокаПодключенияПоШаблонуИПараметрам(Шаблон, Знач Параметры) Экспорт
	
	СтрокаПодключения = СокрЛП(ВРег(Шаблон));
	СтрокаПодключения = СтрЗаменить(СтрокаПодключения, "%SERVER%", Параметры.Сервер);
	СтрокаПодключения = СтрЗаменить(СтрокаПодключения, "%DBNAME%", Параметры.База);
	СтрокаПодключения = СтрЗаменить(СтрокаПодключения, "%LOGIN%", Параметры.Логин);
	СтрокаПодключения = СтрЗаменить(СтрокаПодключения, "%PASSWORD%", Параметры.Пароль);
	Возврат СтрокаПодключения;
	
КонецФункции

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Функция НовыйПараметрADO(Команда, Элемент, ТипыПараметровADO)
	Перем ТипПараметра, РазмерПараметра;
	Перем НовыйПараметр;
	
	РазмерПараметра = 0;
	ПараметрЦелоеЧисло = Ложь;
	Если ТипЗнч(Элемент.ЗначениеПараметра) = Тип("Число") Тогда
		ПараметрЦелоеЧисло = Цел(Элемент.ЗначениеПараметра) = Элемент.ЗначениеПараметра;			
		ТипПараметра = ?(ПараметрЦелоеЧисло, ТипыПараметровADO.ЦелоеЧисло, ТипыПараметровADO.ДробноеЧисло);
	ИначеЕсли ТипЗнч(Элемент.ЗначениеПараметра) = Тип("Строка") Тогда
		ТипПараметра = ТипыПараметровADO.Строка;
		РазмерПараметра = СтрДлина(Элемент.ЗначениеПараметра);
	ИначеЕсли ТипЗнч(Элемент.ЗначениеПараметра) = Тип("Дата") Тогда
		ТипПараметра = ТипыПараметровADO.ДатаВремя;
	ИначеЕсли ТипЗнч(Элемент.ЗначениеПараметра) = Тип("Булево") Тогда
		ТипПараметра = ТипыПараметровADO.Булево;
	ИначеЕсли ТипЗнч(Элемент.ЗначениеПараметра) = Тип("COMSafeArray") Тогда
		ТипПараметра = ТипыПараметровADO.ДвоичныеДанные;
		РазмерПараметра = Элемент.ЗначениеПараметра.GetLength();
	Иначе
		ТипПараметра = ТипыПараметровADO.Строка;
		РазмерПараметра = 0;
	КонецЕсли;
	
	Если ТипПараметра = ТипыПараметровADO.Строка Тогда
		Килобайт = 1024;
		Размер = Макс(РазмерПараметра, Килобайт);
		НовыйПараметр = Команда.CreateParameter(Элемент.ИмяПараметра, ТипПараметра, Элемент.НаправлениеПараметра, Размер);
	ИначеЕсли ТипПараметра = ТипыПараметровADO.ДвоичныеДанные Тогда
		НовыйПараметр = Команда.CreateParameter(Элемент.ИмяПараметра, ТипПараметра, Элемент.НаправлениеПараметра, РазмерПараметра);
	Иначе
		НовыйПараметр = Команда.CreateParameter(Элемент.ИмяПараметра, ТипПараметра, Элемент.НаправлениеПараметра);
	КонецЕсли;
	
	Если ПараметрЦелоеЧисло Тогда
		НовыйПараметр.Precision = 22;
	Иначе
		Если ТипПараметра = ТипыПараметровADO.ДробноеЧисло Тогда
			НовыйПараметр.Precision = 22;
			НовыйПараметр.NumericScale = 6;
		КонецЕсли;
	КонецЕсли;
	
	Возврат НовыйПараметр;
КонецФункции

Функция ВидВызоваДляЛогированияАДО(СоединениеАДО)
	
	Сервер = "";
	ИмяБазыДанных = "";
	Для Каждого Свойство Из СоединениеАДО.Properties Цикл
		Если ВРег(Свойство.Name) = "SERVER NAME" Тогда
			Сервер = Свойство.Value;
		ИначеЕсли ВРег(Свойство.Name) = "CURRENT CATALOG" Тогда
			ИмяБазыДанных = Свойство.Value;
		КонецЕсли;
	КонецЦикла;
	
	ВидВызова = СтрШаблон("Сервер = %1; База = %2", Сервер, ИмяБазыДанных);
	Возврат ВидВызова;
	
КонецФункции

Функция ИспользоватьДляПараметровХППризнакOUT(ConnectionString)
	// При формировании вызова хранимых процедур с возвращаемыми праметрами в зависимости
	// от используемой строки подключения ошибку может вызывать как отсутствие у такого
	// параметра признака OUT, так и его присутствие. 
	СтрокаПодключения = СтрЗаменить(ВРЕГ(ConnectionString), " ", "");
	
	ПризнакНеобходимостиОтказатьсяОтOUT = РегистрыСведений.ПараметрыГлобальные.ЗначениеПараметра("1312.ПризнакНеобходимостиОтказатьсяОтOUT");
	ПризнакНеобходимостиОтказатьсяОтOUT = СтрЗаменить(ВРЕГ(ПризнакНеобходимостиОтказатьсяОтOUT), " ", "");
	ИспользоватьПризнакOUT = СтрНайти(СтрокаПодключения, ПризнакНеобходимостиОтказатьсяОтOUT) = 0;
	
	Возврат ИспользоватьПризнакOUT;
КонецФункции

#КонецОбласти
